{
  "blog_category": "blog_category5",
  "title": "Top 10 Things to Do in the Florida Keys",
  "image": {
    "name": "Top 10 Things to Do in the Florida Keys",
    "content_type": "image/jpeg",
    "date_added": "2019-11-19-095543",
    "url_thumb": "//res.cloudinary.com/traveltripperweb/image/upload/c_fill,g_faces,h_140,w_140/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "url_xsmall": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_300,w_300/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "url_small": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_768,w_768/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "url_medium": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_992,w_992/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "url_large": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_1200,w_1200/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "url_xlarge": "//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_1920,w_1920/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "url": "//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "width": 960,
    "height": 485,
    "format": "jpg",
    "url_raw": "//res.cloudinary.com/traveltripperweb/image/upload/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "resource_type": "image",
    "size": 118066,
    "path": "//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1574175344/jnsey1onelxsboucdjdo.jpg",
    "file_size": null,
    "alt": "Top 10 Things to Do in the Florida Keys",
    "caption": "",
    "description": ""
  },
  "url_friendly_name": "top-10-things-to-do-in-the-florida-keys",
  "date": "2019-02-11T00:00:00.000Z",
  "post_content": "<p>Your suitcase is packed, your flights are booked, and you&rsquo;re almost ready for your Florida Keys vacation. The last step before setting off to the sun and sand: building your trip itinerary. Whether you want to map out each day or just have a list of your &ldquo;must-sees,&rdquo; customize your trip guide to best suit your vacation.</p>\n<p>Don&rsquo;t leave the Keys wishing you had made time to explore more. Use our guide to fill your trip itinerary with some of the best things to do in the Florida Keys.</p>\n<h3><strong>The Beaches</strong></h3>\n<p>The main attraction in the Keys, the beaches found in Key West are among the most beautiful in the world. Grab your towel and sunscreen and head over to the best local beaches found just a short drive from our hotel on Stock Island. Some of our favorites include Smathers Beach, South Beach, and Fort Zachary Taylor.</p>\n<h3><strong>Duval Street</strong></h3>\n<p>A center for shopping, dining, and culture in Key West, Duval Street is home to a variety of local entertainment and fun. From hole-in-the-wall bars and outdoor cafes to art galleries and cultural sights, there is no shortage of excitement to be found on Duval Street.</p>\n<h3><strong>The Ernest Hemingway House &amp; Museum</strong></h3>\n<p>Known locally as simply the <a href=\"https://www.hemingwayhome.com/\">Hemingway House</a>, this local site was once home to one of America&rsquo;s most honored and respected authors. Ernest Hemingway lived and wrote in the Florida Keys for more than ten years. Explore on your own or go on a guided tour of the home and gardens that inspired some of Hemingway&rsquo;s greatest works.</p>\n<h3><strong>The Architecture</strong></h3>\n<p>Home to one of the largest historical districts in the U.S., Key West showcases a unique array of buildings including nearly 3,000 wooden structures. Take a stroll through Old Town and take in the local architecture featuring a rainbow of pastel colors and Victorian influences.</p>\n<h3><strong>Kayaking and Paddleboarding</strong></h3>\n<p>Delight your inner adventurer on the open water. Take to the ocean and try your hand at some of Key West&rsquo;s most popular pastimes: <a href=\"https://www.oceansedgekeywest.com/kayakpaddle?_icid=blog-oekw-10things-february2019\">kayaking and paddleboarding</a>. With rentals available through our concierge and tiki hut, you&rsquo;ll be on the water in no time.</p>\n<h3><strong>The Seafood</strong></h3>\n<p>Satisfy all of your cravings with the country&rsquo;s best selection of fresh seafood. It comes as no surprise that Key West has an immense and diverse selection of seafood, including everything from grouper and oysters to crab and lobster. Our own onsite <a href=\"https://www.oceansedgekeywest.com/hotel/yellowfin-bar-and-grill?_icid=blog-oekw-top10-february19\">Yellowfin Bar and Grill</a> offers a delicious menu featuring snapper, tuna, and more.</p>\n<h3><strong>Key Lime Pie</strong></h3>\n<p>A famous local staple, Key lime pie is perfected in Key West. Made up of Key lime juice, egg, condensed milk and a shortbread crust, sample this tantalizingly tart and sweet dessert during your visit. Find the famous dessert a popular local shops including: <a href=\"https://www.keylimeshop.com/\">Kermit&rsquo;s Key West Key Lime Shoppe</a>, <a href=\"http://www.blueheavenkw.com/\">Blue Haven</a>, and <a href=\"https://key-lime-pie-bakery.myshopify.com/\">Key Lime Pie Bakery</a>.</p>\n<h3><strong>Key West Lighthouse</strong></h3>\n<p>The <a href=\"https://www.kwahs.org/museums/lighthouse-keepers-quarters/history\">Key West Lighthouse</a> was opened in 1848 after a series of hurricanes destroyed the former lighthouses of the early 1800s. After being decommissioned in 1969, the lighthouse was transitioned into a museum dedicated to celebrating the rich maritime history of Key West, as well as the men and women who kept the light burning through devastating weather.</p>\n<h3><strong>Tastes of Cuba</strong></h3>\n<p>Once in Key West, its hard to miss the distinct Cuban influences prevalent throughout the city. Explore everything from the historical landmarks dating back to the 1800s to the dynamic Cuban flavors found in the local cuisine. Treat yourself to the deliciously authentic Cuban fare served up at <a href=\"http://www.elsiboneyrestaurant.com/\">El Siboney Restaurant</a> and <a href=\"https://www.elmesondepepe.com/\">El Meson de Pepe&rsquo;s Restaurant &amp; Bar</a>.</p>\n<h3><strong>Southernmost Point Buoy</strong></h3>\n<p>Get your cameras ready when you stop by one of Key West&rsquo;s most famous landmarks, the <a href=\"https://www.cityofkeywest-fl.gov/egov/apps/locations/facilities.egov?view=detail&amp;id=79\">Southernmost Point Buoy</a>. This popular attraction is an anchored, concrete buoy marking the southernmost point of the continental U.S. First erected in 1983, the buoy makes the perfect photo-op of your time in Key West.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
}