{
  "order": 8,
  "name": "Light-Tackle Fishing",
  "category": "activities_categories1",
  "url_friendly_name": "light-tackle-fishing",
  "description": "<p>If you prefer reef fishing in Key West, consider any of our exciting options below.</p>\n<p><strong>Reel Contender</strong></p>\n<p>Reel Contender is an offshore light tackle charter boat designed for getting to the fish first on the waters out of Key West, Florida. Whether it&rsquo;s Sailfishing you are after or jigging over deep wrecks, or even deep dropping for Swordfish &ndash; Reel Contender will get the job done. Enjoy your fishing trip aboard &ldquo;Reel Contender&rdquo;, a spacious 30-ft center console, which comes powered by twin 250 HP Suzuki engines.&nbsp; There is a toilet on board for your maximum comfort when spending your day on the water, an ice-box to keep the catch fresh, and a live bait tank, as well as outriggers and downriggers for a professional fishing experience. The &ldquo;Reel Contender&rdquo; provides comfortable fishing space for up to six guests. From light and heavy tackle to kite fishing, fly fishing, jigging, trolling, drift fishing, popping, spinning, and bottom fishing &ndash; the Captain knows all the best methods to catch the fish. Your main targeted species will be Sailfish, Blackfin Tuna, Wahoo, Tarpon, Yellowtail Snapper, Permit, King Mackerel, Grouper, Mahi Mahi, Cobia, Barracuda, Amberjack&hellip; and who knows what else?</p>\n<p>Call 786-862-6303 or email <a href=\"/websites/998/environments/28550/models/activities/instances/m\">concierge@oceansedgekeywest.com</a> to book now.</p>\n<p><strong>Reel Fly</strong></p>\n<p>Chris Trosset is a true Key West conch who knows the Lower Keys like the back of his hand. Thanks to his infamous dad, RT, Chris has inherited the ultimate angling knowledge of how to catch all kinds of offshore and inshore fish in Key West, the Dry Tortugas and beyond. His quiet, mellow demeanor at the dock is the calm before the storm because once he get's you to the fishing grounds, baits in the water, he will light up! Whether it's kingfish, black tuna, or black grouper, Chris will put you on some of the biggest fish you have ever seen.&nbsp;</p>\n<p>Call 786-862-6303 or email <a href=\"mailto:concierge@oceansedgekeywest.com\">concierge@oceansedgekeywest.com</a> to book now.</p>\n<p><strong>Total Fisherman</strong></p>\n<p>Total Fisherman Fishing Charters are for four (1/2 day), six (3/4 day) or eight hours (full day). *Prices are for up to four anglers. An additional fifth or sixth angler is $50 each.</p>\n<p>&frac12; Day Trips (4 Hours) &ndash; $650</p>\n<p>These are typically reef fishing trips where we anchor the boat and target a variety of Snappers (Yellowtail, Mutton, Mangrove), Grouper (Red, Black, Hind, Goliath), Jacks (Amberjack, Yellow Jack, Crevalle Jack), Barracuda and a variety of sharks.</p>\n<p>&frac34; Day Trips (6 Hours) - $850</p>\n<p>Since we have more time than a half day trip, we generally start on the reef and then move to deeper water structure such as a wreck or go offshore into deeper waters to target species such as Sailfish, Wahoo, Kingfish and Mahi Mahi.</p>\n<p>Full Day Trips (8 hours) &ndash; $1100.&nbsp; &nbsp;These trips allow the most time to get to the best fishing locations, we often run to the end of The Bar or to the waters near the Marquesas Atoll.</p>\n<p>Visit our website for more information. Call 305-809-8454 or email <a href=\"mailto:concierge@oceansedgekeywest.com\">concierge@oceansedgekeywest.com</a> to book now.</p>",
  "terms_conditions": "Cost",
  "price": "Please inquire"
}